package w8_2;
/**56. Написать программу, моделирующую систему Контрольно-пропускного пункта на предприятии. 
 * Система КПП состоит из турникета, проход через который осуществляется с помощью карточек доступа.
 *  Каждой карточке доступа соответствует уникальный код, однозначно идентифицирующий сотрудника.
 *   Каждый раз. когда сотрудник входит или выходит из здания, турникет посылает системе данные карты
 *    (код) и дату входа/выхода. Система должна уметь:
 * показывать текущее количество сотрудников в здании
 *показывать время, когда в здании находилось максимальное количество сотрудников
 *сообщать об исключительных ситуациях при попытках несанкционированного доступа/выхода в/из здание/-я:
 *кто-то пытается выйти из здания, когда в здании нет сотрудников
 *кто-то пытается войти в здание по карточке с незарегестрированным номером
 * кто-то пытается войти с картой, которая уже “вошла” в здание
 * кто-то пытается выйти по картой, которая уже “вышла” из здания
*/
public class AccessControll {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
